;***************************************************************************
;
;    Copyright (C) 2014 t_sato
;
;    A20 gate Test
;
;***************************************************************************
[BITS 16]

[global _a20_gate_on]

%macro _a20_test 1
	call	a20_test
	jnz		a20_down
%endmacro

;:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
segment .text

;--------------------------------------------------------------------
; void a20_gate_on( void )
;--------------------------------------------------------------------
_a20_gate_on:

; A20ÉQÅ[ÉgÇ™Ç†ÇÈÇ©ämÇ©ÇﬂÇÈ
a20_none:
	_a20_test	0

; BIOS(INT 0x15  ax = 0x2401)Ç≈ééÇµÇƒÇ›ÇÈ
; challenge in the BIOS(int 0x15  ax = 0x2401)
a20_bios:
	mov		ax,0x2401
	pushfd
	int		0x15
	popfd
	
	_a20_test	0
	
a20_err:
	jmp		$

;--------------------------------------------------------------------
; a20_test
;--------------------------------------------------------------------
a20_test:
	push	ax
	push	cx
	xor		cx,cx
	mov		fs,cx		; Low  memory
	dec		cx
	mov		gs,cx		; High memory
	mov		cx,10		; åJÇËï‘ÇµâÒêî
	mov		ax,word[fs:4*0x80]
	push	ax
	mov		ax,32
a20_test_loop:
	inc		ax
	mov		word[fs:4*0x80],ax
	call	a20_delay				; delay
	cmp		ax,word[gs:4*0x80+0x10]
	loop	a20_test_loop
	
	pop		word[fs:4*0x80]
	pop		cx
	pop		ax
	ret

;--------------------------------------------------------------------
; delay
;--------------------------------------------------------------------
a20_delay:
	out		0x80,al
	ret

;--------------------------------------------------------------------
; complete
;--------------------------------------------------------------------
a20_down:
	ret

